Tekla.Structures.Analysis.AnalysisModel.AnalysisMethodEnum
The analysis methods.

Tekla.Structures.Analysis.AnalysisModel.AnalysisMethodEnum.FIRST_ORDER
The first order analysis method.

Tekla.Structures.Analysis.AnalysisModel.AnalysisMethodEnum.SECOND_ORDER
The second order analysis method.

Tekla.Structures.Analysis.AnalysisModel.AnalysisMethodEnum.P_DELTA
The P Delta analysis method.